<h1>Добро пожаловать!</h1>
<h2>
Вариант №3. «Система анализа комплектации товара»<br>
Написать Web-приложение для обеспечения возможности комплектации компьютера и дальнейшей его покупки. Предусмотреть две роли: администратор и клиент. Для клиента предусмотреть возможность регистрации в системе. <br>
Администратор заполняет основную информацию о комплектующих компьютера:<br>
1. наименование;<br>
2. основные характеристики (не менее 5 для каждого комплектующего);<br>
3. цена за комплектующее при продаже как отдельный товар;<br>
4. цена за комплектующее при продаже в комплекте.<br>
Администратор также должен иметь возможность составлять готовую сборку компьютера из имеющихся комплектующих. Клиент входит в систему и может сформировать заказ на компьютер, выбирая комплектующие из представленного набора. Клиенту должно быть представлены возможности: <br>
1. выбора компьютера заранее подготовленной комплектации;<br>
2. самостоятельно выбирать комплектующие для компьютера. При этом должна появляться подсказка о тех типах комплектующих, которые еще не добавлены в список.<br>
3. видеть список наиболее часто приобретаемых комплектующих выбранного типа по результатам предыдущих продаж.<br>
Администратор должен иметь возможность просматривать статистику выбора пользователей в разрезе популярности отдельных комплектующих, общей стоимости собранных компьютеров по дням. Представление статистики в виде графиков приветствуется.<br>
</h2>